{"_path":"/articles/choosing-the-right-data-type-means-of-generating-unique-primary-keys","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"Articles - Choosing the right data type & means of generating unique primary keys","description":"I've been taking some time to investigate the options for how to safely generate unique primary keys for database records. Most of the time, as a developer, you probably won't need to think about this topic, but for those that do, this article is for you.","excerpt":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"choosing-the-right-data-type--means-of-generating-unique-primary-keys"},"children":[{"type":"text","value":"Choosing the right data type & means of generating unique primary keys"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"span","props":{"className":["meta"]},"children":[{"type":"text","value":"10th January 2022"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While building Lumeno, I've been taking some time to investigate the options for how to safely generate unique primary keys for database records. Most of the time, as a developer, you probably won't need to think about this topic, but for those that do, this article is for you."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"the-voice-of-reason"},"children":[{"type":"text","value":"The voice of reason"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Before we dig into the meat of this topic, it is worth pointing out that I’ve seen quite a few developers assume that they need to use a more complex system in order to generate unique identifiers for their primary keys."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you’re building a system that is enterprise in nature, or you’re familiar with and need to use features like clusters, regions, replicas, and so on, then this is probably true. However, most of the time, developers are building modest applications powered by databases running on a single, modest server."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If this is you, then the default method of generating unique primary keys (auto-incrementing integers), should serve you just fine. Indeed, there are significant benefits to sticking with them…"}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"auto-incrementing-integers"},"children":[{"type":"text","value":"Auto-incrementing integers"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you’re at least somewhat familiar with databases, then you’ll know that this is the standard way of generating unique keys. Behind the scenes, the system maintains an internal counter. When you insert a record, it increments the counter and sets the new record’s primary key to that value."}]},{"type":"element","tag":"h5","props":{"id":"is-this-a-good-approach"},"children":[{"type":"text","value":"Is this a good approach?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In short, yes! While there is a slight overhead in maintaining the counter, in practice it’s negligible. On the plus side, your records will always be unique, easily-indexed and super fast (in fact, its always the fastest option)."}]},{"type":"element","tag":"h5","props":{"id":"when-should-i-opt-for-the-something-different"},"children":[{"type":"text","value":"When should I opt for the something different?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I’ve already mentioned a few scenarios when you might want to consider something different, but even in those cases, you should ask yourself if you can still stick with incrementing integers. Sometimes, simply adjusting your schema to use a larger data type e.g. "},{"type":"element","tag":"code-inline","props":{},"children":[{"type":"text","value":"BIG INT"}]},{"type":"text","value":", is enough."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even if it’s not such a minimal adjustment, in a lot of cases, if you design your application and database correctly, then you can still use them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, if you find you are making too many compromises, your app is becoming unwieldy, or your setup makes it too complex to use a database counter, then it may be time to reach for something else…"}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"alternatives-its-a-jungle-out-there"},"children":[{"type":"text","value":"Alternatives... it’s a jungle out there"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Okay, so you’ve decided that auto-incrementing integers are not for you. What do you use instead? Well, if you consult your database manual, you probably won’t get much help. Databases provide a default method. If you don’t want to use it, then you’re largely on your own. So, you go to the internet…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Congratulations! You’ve discovered endless different ways of generating a unique string of characters to use as a primary key and you come away with no clear understanding of which one to use. Fortunately, when it comes to a database at least, choosing one really depends on just four things:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Uniqueness"}]},{"type":"text","value":". Every method of generating a key has a possibility of causing a collision (two generated keys being the same). Therefore, you want to choose a method with as low a risk of collision as possible."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Lexicography"}]},{"type":"text","value":". A complicated-sounding word that basically refers to some means of organization. In the database, we’re talking about being able to order our records using the key."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Efficiency"}]},{"type":"text","value":". Depending on the method you choose, your database might already include a function to generate a key using the algorithm. However, even if it does, it may be better to generate it within your app so the DB has less to do. Note that there are tradeoffs with this approach e.g. not being able to do things like "},{"type":"element","tag":"code-inline","props":{},"children":[{"type":"text","value":"INSERT INTO SELECT"}]},{"type":"text","value":"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Storage"}]},{"type":"text","value":". Everything from the length of the key, to what it consists of, to how you store it in the database e.g. as an integer, a string, as binary etc."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now we know what to look for, let’s examine some options. I’m only going to cover a few because (as you’d discover from research) there are only so many ways you can generate a string of characters. In other words, many of the different algorithms are really just variations on a theme."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"uuids-aka-the-gold-standard"},"children":[{"type":"text","value":"UUIDS aka the gold standard"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These are the granddaddy of unique keys. The acronym stands for universally unique identifier, which is quite frankly absurd. How can we possibly know it is unique in the universe? Microsoft opted to call it GUID, which is a globally unique identifier. That makes much more sense, but for whatever reason, outside of Microsoft (and its products), UUID is the term that stuck."}]},{"type":"element","tag":"h5","props":{"id":"so-what-is-it"},"children":[{"type":"text","value":"So, what is it?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A UUID is a 128 bit string of alphanumeric characters broken up by dashes to make it readable. 128 bits translates to 32 characters, so it looks like this:"}]},{"type":"element","tag":"code","props":{"code":"123e4567-e89b-12d3-a456-426614174000\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"text","value":"123e4567-e89b-12d3-a456-426614174000\n"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Simple enough, right? Well no. There are actually 5 different ways of creating a UUID. Seriously? But wait, it gets better!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Draft proposals exist for creating versions 6, 7 and 8. If you’re reading this and thinking to yourself, “how can there possibly need to be 8 different ways to create a string of characters?”, then I’m definitely with you."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I’m not going to go into the different algorithms used to generate the versions. All I’ll say is that if you want a truly random UUID, then you need to use V4."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are countless libraries available for every programming language you can probably think of. Further, many databases include native functions for generating them (you’ll need to check which versions they generate though)."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"ulids"},"children":[{"type":"text","value":"ULIDS"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This stands for universally unique lexicographically sortable identifier. It aims to improve on the current UUID formats by offering shorter, sortable keys."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs are 26 characters in length and use a format that includes a timestamp at the beginning (which makes them sortable). A ULID looks like this:"}]},{"type":"element","tag":"code","props":{"code":"01ARZ3NDEKTSV4RRFFQ69G5FAV\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"text","value":"01ARZ3NDEKTSV4RRFFQ69G5FAV\n"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs also include some other features, which make it more attractive than UUIDs such as case insensitivity, base32, and so on."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them-1"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Github repo containing the specification for the format also maintains a list of implementations in different programming languages (the default is JavaScript, which makes it ideal for a lot of applications)."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"snowflakes"},"children":[{"type":"text","value":"Snowflakes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This way of generating keys was developed by Twitter for their own systems and it has since been adopted by other big tech companies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unlike UUIDs and ULIDs, snowflake IDs only consist of numbers. In addition, they are the shortest at just 16 characters. A snowflake looks like this:"}]},{"type":"element","tag":"code","props":{"code":"3398978255192064\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"text","value":"3398978255192064\n"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Snowflake identifiers also have the benefit of starting with a timestamp, which makes them sortable."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them-2"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Twitter have archived the open-source repository containing the source code for their original implementation. It appears to have now been folded into their Twitter server project. However, many separate implementations exist for most of the major programming languages."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"which-should-we-use"},"children":[{"type":"text","value":"Which should we use?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The short answer is, it depends. Each method has benefits, whether it is ease-of-use, library availability, overall familiarity, performance, efficiency, the need to work with data already in a similar format, etc."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Since there is no “correct” way as such, I’ll explain which of them I chose and why I did. To do that, I’ll go back to the checklist I wrote earlier in the article:"}]},{"type":"element","tag":"h5","props":{"id":"uniqueness"},"children":[{"type":"text","value":"Uniqueness"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Each of the three implementations claims to handle this well, with all of them being able to generate thousands of keys per millisecond without collision. So in truth, this isn’t really a factor when choosing one over the others."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are some limits when it comes to the maximum number of keys you can create, but these are way off in the future e.g. the year 2060 or more, and it is somewhat unlikely any system built today will still be in operation then, or at the very least, won’t have been significantly changed in the preceding years."}]},{"type":"element","tag":"h5","props":{"id":"lexicography"},"children":[{"type":"text","value":"Lexicography"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Certain implementations of UUID are sortable (versions 1 and 2), however since these versions depend on MAC addresses, they tend not to be used due to potential security risks. You’ll also find variations of version 4, which have reordered the key so that the timestamp is first, this makes it sortable, but concerns have been raised about collision / randomness as a result."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs were always designed to be sortable by beginning with timestamps. The same is also true of Snowflakes."}]},{"type":"element","tag":"h5","props":{"id":"efficiency"},"children":[{"type":"text","value":"Efficiency"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This one should be fairly obvious. Since UUIDs have the longest length, they take the longest to generate, followed by ULIDs, and then Snowflakes. I did some superficial benchmarks to see what the difference was and the results were quite striking. They might not seem like much, but at scale, when you need to generate thousands of records a second, it really adds up:"}]},{"type":"element","tag":"code","props":{"code":"Standard UUID v4 - 5.6 milliseconds\nSortable UUID v4 - 8.3 milliseconds\nULID             - 3.1 milliseconds\nSnowflake        - 0.4 milliseconds\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"text","value":"Standard UUID v4 - 5.6 milliseconds\nSortable UUID v4 - 8.3 milliseconds\nULID             - 3.1 milliseconds\nSnowflake        - 0.4 milliseconds\n"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition, since the primary keys will also serve as foreign keys, queries that use them as part of a join will be significantly faster if they are integers. Put simply, integers are better than strings in every metric and in any scenario."}]},{"type":"element","tag":"h5","props":{"id":"storage"},"children":[{"type":"text","value":"Storage"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Like efficiency, UUID takes up the most space, followed by ULID, and then Snowflake. It should also be noted that indexing of strings takes up a lot more space and is less efficient than indexing of integers."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For example, a 100,000 record index involving integer primary keys is a couple of megabytes, but for strings it can jump to several hundred. You can make this more efficient by converting the strings to binary, but then your app has to handle converting to and from binary which is cumbersome."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, I seeded a test database of 100,000 users and several million records per ancillary table. With Snowflake IDs, the DB was roughly 2.7 GB. When using strings (UUID or ULID), it was around 6.2 GB."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This might not seem like much, but the smaller the DB is, the more of it you can fit into memory, resulting in much better performance."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"conclusion"},"children":[{"type":"text","value":"Conclusion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Of the three options, Snowflake is the clear winner. First, it is the shortest, which means it uses less space. It also begins with a timestamp, which makes it sortable. Finally, since it is an integer, it can be indexed faster, and queries that use it in joins will also be measurably faster."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Another added benefit, is that even though Snowflake uses integers, it does not use simple auto-incrementation, which means it is impossible to guess how many records are in the database table. While this is security through obscurity, it is a nice little cherry to have on the cake."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"wrapping-up"},"children":[{"type":"text","value":"Wrapping Up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I hope you enjoyed this article and that you found something interesting in it. If you’d like to see more from me, then you can follow me on Twitter."}]}]},"date":"10th January 2022","image":{"src":"/assets/images/4.choosing-the-right-data-type-means-of-generating-unique-primary-keys.jpg"},"head":{"meta":[{"property":"og:title","content":"Choosing the right data type & means of generating unique primary keys"},{"property":"og:description","content":"I've been taking some time to investigate the options for how to safely generate unique primary keys for database records. Most of the time, as a developer, you probably won't need to think about this topic, but for those that do, this article is for you."}]},"body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"choosing-the-right-data-type--means-of-generating-unique-primary-keys"},"children":[{"type":"text","value":"Choosing the right data type & means of generating unique primary keys"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"span","props":{"className":["meta"]},"children":[{"type":"text","value":"10th January 2022"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While building Lumeno, I've been taking some time to investigate the options for how to safely generate unique primary keys for database records. Most of the time, as a developer, you probably won't need to think about this topic, but for those that do, this article is for you."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"the-voice-of-reason"},"children":[{"type":"text","value":"The voice of reason"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Before we dig into the meat of this topic, it is worth pointing out that I’ve seen quite a few developers assume that they need to use a more complex system in order to generate unique identifiers for their primary keys."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you’re building a system that is enterprise in nature, or you’re familiar with and need to use features like clusters, regions, replicas, and so on, then this is probably true. However, most of the time, developers are building modest applications powered by databases running on a single, modest server."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If this is you, then the default method of generating unique primary keys (auto-incrementing integers), should serve you just fine. Indeed, there are significant benefits to sticking with them…"}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"auto-incrementing-integers"},"children":[{"type":"text","value":"Auto-incrementing integers"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you’re at least somewhat familiar with databases, then you’ll know that this is the standard way of generating unique keys. Behind the scenes, the system maintains an internal counter. When you insert a record, it increments the counter and sets the new record’s primary key to that value."}]},{"type":"element","tag":"h5","props":{"id":"is-this-a-good-approach"},"children":[{"type":"text","value":"Is this a good approach?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In short, yes! While there is a slight overhead in maintaining the counter, in practice it’s negligible. On the plus side, your records will always be unique, easily-indexed and super fast (in fact, its always the fastest option)."}]},{"type":"element","tag":"h5","props":{"id":"when-should-i-opt-for-the-something-different"},"children":[{"type":"text","value":"When should I opt for the something different?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I’ve already mentioned a few scenarios when you might want to consider something different, but even in those cases, you should ask yourself if you can still stick with incrementing integers. Sometimes, simply adjusting your schema to use a larger data type e.g. "},{"type":"element","tag":"code-inline","props":{},"children":[{"type":"text","value":"BIG INT"}]},{"type":"text","value":", is enough."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even if it’s not such a minimal adjustment, in a lot of cases, if you design your application and database correctly, then you can still use them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, if you find you are making too many compromises, your app is becoming unwieldy, or your setup makes it too complex to use a database counter, then it may be time to reach for something else…"}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"alternatives-its-a-jungle-out-there"},"children":[{"type":"text","value":"Alternatives... it’s a jungle out there"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Okay, so you’ve decided that auto-incrementing integers are not for you. What do you use instead? Well, if you consult your database manual, you probably won’t get much help. Databases provide a default method. If you don’t want to use it, then you’re largely on your own. So, you go to the internet…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Congratulations! You’ve discovered endless different ways of generating a unique string of characters to use as a primary key and you come away with no clear understanding of which one to use. Fortunately, when it comes to a database at least, choosing one really depends on just four things:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Uniqueness"}]},{"type":"text","value":". Every method of generating a key has a possibility of causing a collision (two generated keys being the same). Therefore, you want to choose a method with as low a risk of collision as possible."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Lexicography"}]},{"type":"text","value":". A complicated-sounding word that basically refers to some means of organization. In the database, we’re talking about being able to order our records using the key."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Efficiency"}]},{"type":"text","value":". Depending on the method you choose, your database might already include a function to generate a key using the algorithm. However, even if it does, it may be better to generate it within your app so the DB has less to do. Note that there are tradeoffs with this approach e.g. not being able to do things like "},{"type":"element","tag":"code-inline","props":{},"children":[{"type":"text","value":"INSERT INTO SELECT"}]},{"type":"text","value":"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Storage"}]},{"type":"text","value":". Everything from the length of the key, to what it consists of, to how you store it in the database e.g. as an integer, a string, as binary etc."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now we know what to look for, let’s examine some options. I’m only going to cover a few because (as you’d discover from research) there are only so many ways you can generate a string of characters. In other words, many of the different algorithms are really just variations on a theme."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"uuids-aka-the-gold-standard"},"children":[{"type":"text","value":"UUIDS aka the gold standard"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These are the granddaddy of unique keys. The acronym stands for universally unique identifier, which is quite frankly absurd. How can we possibly know it is unique in the universe? Microsoft opted to call it GUID, which is a globally unique identifier. That makes much more sense, but for whatever reason, outside of Microsoft (and its products), UUID is the term that stuck."}]},{"type":"element","tag":"h5","props":{"id":"so-what-is-it"},"children":[{"type":"text","value":"So, what is it?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A UUID is a 128 bit string of alphanumeric characters broken up by dashes to make it readable. 128 bits translates to 32 characters, so it looks like this:"}]},{"type":"element","tag":"code","props":{"code":"123e4567-e89b-12d3-a456-426614174000\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"123e4567-e89b-12d3-a456-426614174000"}]}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Simple enough, right? Well no. There are actually 5 different ways of creating a UUID. Seriously? But wait, it gets better!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Draft proposals exist for creating versions 6, 7 and 8. If you’re reading this and thinking to yourself, “how can there possibly need to be 8 different ways to create a string of characters?”, then I’m definitely with you."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I’m not going to go into the different algorithms used to generate the versions. All I’ll say is that if you want a truly random UUID, then you need to use V4."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are countless libraries available for every programming language you can probably think of. Further, many databases include native functions for generating them (you’ll need to check which versions they generate though)."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"ulids"},"children":[{"type":"text","value":"ULIDS"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This stands for universally unique lexicographically sortable identifier. It aims to improve on the current UUID formats by offering shorter, sortable keys."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs are 26 characters in length and use a format that includes a timestamp at the beginning (which makes them sortable). A ULID looks like this:"}]},{"type":"element","tag":"code","props":{"code":"01ARZ3NDEKTSV4RRFFQ69G5FAV\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"01ARZ3NDEKTSV4RRFFQ69G5FAV"}]}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs also include some other features, which make it more attractive than UUIDs such as case insensitivity, base32, and so on."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them-1"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Github repo containing the specification for the format also maintains a list of implementations in different programming languages (the default is JavaScript, which makes it ideal for a lot of applications)."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"snowflakes"},"children":[{"type":"text","value":"Snowflakes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This way of generating keys was developed by Twitter for their own systems and it has since been adopted by other big tech companies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unlike UUIDs and ULIDs, snowflake IDs only consist of numbers. In addition, they are the shortest at just 16 characters. A snowflake looks like this:"}]},{"type":"element","tag":"code","props":{"code":"3398978255192064\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"3398978255192064"}]}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Snowflake identifiers also have the benefit of starting with a timestamp, which makes them sortable."}]},{"type":"element","tag":"h5","props":{"id":"how-do-i-create-them-2"},"children":[{"type":"text","value":"How do I create them?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Twitter have archived the open-source repository containing the source code for their original implementation. It appears to have now been folded into their Twitter server project. However, many separate implementations exist for most of the major programming languages."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"which-should-we-use"},"children":[{"type":"text","value":"Which should we use?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The short answer is, it depends. Each method has benefits, whether it is ease-of-use, library availability, overall familiarity, performance, efficiency, the need to work with data already in a similar format, etc."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Since there is no “correct” way as such, I’ll explain which of them I chose and why I did. To do that, I’ll go back to the checklist I wrote earlier in the article:"}]},{"type":"element","tag":"h5","props":{"id":"uniqueness"},"children":[{"type":"text","value":"Uniqueness"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Each of the three implementations claims to handle this well, with all of them being able to generate thousands of keys per millisecond without collision. So in truth, this isn’t really a factor when choosing one over the others."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are some limits when it comes to the maximum number of keys you can create, but these are way off in the future e.g. the year 2060 or more, and it is somewhat unlikely any system built today will still be in operation then, or at the very least, won’t have been significantly changed in the preceding years."}]},{"type":"element","tag":"h5","props":{"id":"lexicography"},"children":[{"type":"text","value":"Lexicography"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Certain implementations of UUID are sortable (versions 1 and 2), however since these versions depend on MAC addresses, they tend not to be used due to potential security risks. You’ll also find variations of version 4, which have reordered the key so that the timestamp is first, this makes it sortable, but concerns have been raised about collision / randomness as a result."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ULIDs were always designed to be sortable by beginning with timestamps. The same is also true of Snowflakes."}]},{"type":"element","tag":"h5","props":{"id":"efficiency"},"children":[{"type":"text","value":"Efficiency"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This one should be fairly obvious. Since UUIDs have the longest length, they take the longest to generate, followed by ULIDs, and then Snowflakes. I did some superficial benchmarks to see what the difference was and the results were quite striking. They might not seem like much, but at scale, when you need to generate thousands of records a second, it really adds up:"}]},{"type":"element","tag":"code","props":{"code":"Standard UUID v4 - 5.6 milliseconds\nSortable UUID v4 - 8.3 milliseconds\nULID             - 3.1 milliseconds\nSnowflake        - 0.4 milliseconds\n","language":"shell"},"children":[{"type":"element","tag":"pre","props":{},"children":[{"type":"element","tag":"code","props":{"__ignoreMap":""},"children":[{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"Standard UUID v4 - 5.6 milliseconds"}]}]},{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"Sortable UUID v4 - 8.3 milliseconds"}]}]},{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"ULID             - 3.1 milliseconds"}]}]},{"type":"element","tag":"span","props":{"class":"line"},"children":[{"type":"element","tag":"span","props":{"class":"ct-8798d0"},"children":[{"type":"text","value":"Snowflake        - 0.4 milliseconds"}]}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition, since the primary keys will also serve as foreign keys, queries that use them as part of a join will be significantly faster if they are integers. Put simply, integers are better than strings in every metric and in any scenario."}]},{"type":"element","tag":"h5","props":{"id":"storage"},"children":[{"type":"text","value":"Storage"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Like efficiency, UUID takes up the most space, followed by ULID, and then Snowflake. It should also be noted that indexing of strings takes up a lot more space and is less efficient than indexing of integers."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For example, a 100,000 record index involving integer primary keys is a couple of megabytes, but for strings it can jump to several hundred. You can make this more efficient by converting the strings to binary, but then your app has to handle converting to and from binary which is cumbersome."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, I seeded a test database of 100,000 users and several million records per ancillary table. With Snowflake IDs, the DB was roughly 2.7 GB. When using strings (UUID or ULID), it was around 6.2 GB."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This might not seem like much, but the smaller the DB is, the more of it you can fit into memory, resulting in much better performance."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"conclusion"},"children":[{"type":"text","value":"Conclusion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Of the three options, Snowflake is the clear winner. First, it is the shortest, which means it uses less space. It also begins with a timestamp, which makes it sortable. Finally, since it is an integer, it can be indexed faster, and queries that use it in joins will also be measurably faster."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Another added benefit, is that even though Snowflake uses integers, it does not use simple auto-incrementation, which means it is impossible to guess how many records are in the database table. While this is security through obscurity, it is a nice little cherry to have on the cake."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h3","props":{"id":"wrapping-up"},"children":[{"type":"text","value":"Wrapping Up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I hope you enjoyed this article and that you found something interesting in it. If you’d like to see more from me, then you can follow me on Twitter."}]},{"type":"element","tag":"style","children":[{"type":"text","value":".ct-8798d0{color:#24292F}"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-voice-of-reason","depth":3,"text":"The voice of reason"},{"id":"auto-incrementing-integers","depth":3,"text":"Auto-incrementing integers"},{"id":"alternatives-its-a-jungle-out-there","depth":3,"text":"Alternatives... it’s a jungle out there"},{"id":"uuids-aka-the-gold-standard","depth":3,"text":"UUIDS aka the gold standard"},{"id":"ulids","depth":3,"text":"ULIDS"},{"id":"snowflakes","depth":3,"text":"Snowflakes"},{"id":"which-should-we-use","depth":3,"text":"Which should we use?"},{"id":"conclusion","depth":3,"text":"Conclusion"},{"id":"wrapping-up","depth":3,"text":"Wrapping Up"}]}},"_type":"markdown","_id":"content:articles:4.choosing-the-right-data-type-means-of-generating-unique-primary-keys.md","_source":"content","_file":"articles/4.choosing-the-right-data-type-means-of-generating-unique-primary-keys.md","_extension":"md"}